# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, GhostConv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3Ghost, [128]],
   [-1, 1, GhostConv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3Ghost, [256]],
   [-1, 1, GhostConv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3Ghost, [512]],
   [-1, 1, GhostConv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3Ghost, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GAConv, [512, 1, 1]], # 10 256 20 20 

  [10, 1, Split_1, [2]], # 11 128 20 20
  [10, 1, Split_2, [2]], # 12 128 20 20

  [6, 1, Split_1, [2]], # 13 128 40 40
  [6, 1, Split_2, [2]], # 14 128 40 40

  [4, 1, Split_1, [2]], # 15 64 80 80
  [4, 1, Split_2, [2]], # 16 64 80 80

  [12, 1, Split_1, [2]], # 17 64 20 20
  [12, 1, Split_2, [2]], # 18 64 20 20

  [14, 1, Split_1, [4]], # 19 32 40 40
  [14, 1, Split_2, [4]], # 20 96 40 40

  [16, 1, Split_1, [4]], # 21 16 80 80
  [16, 1, Split_2, [4]], # 22 48 80 80 

  [11, 1, nn.Upsample, [None, 2, 'nearest']], # 23 128 40 40
  [[-1, 13], 1, Concat, [1]], # 24 256 40 40
  [-1, 1, GAhostELANStack1_ema, [256]], # 25 128 40 40

  [-1, 1, GAConv, [128, 1, 1]], # 26 64 40 40
  [-1, 1, nn.Upsample, [None, 2, 'nearest']], #27 64 80 80
  [[-1, 15], 1, Concat, [1]], # 28 128 80 80
  [-1, 1, GAhostELANStack1_ema, [128]], # 29 64 80 80

  [[21, 19, 17], 1, ASFF_3, [32, 0]], # 30 16 80 80
  [[30, 22, 29], 1, Concat, [1]], # 31 128 80 80
  [-1, 1, GAhostELANStack1_ema, [256]], # 32 128 80 80

  [29, 1, GAConv, [128, 3, 2]], # 33 64 40 40
  [[-1, 26], 1, Concat, [1]], # 34 128 40 40
  [-1, 1, GAhostELANStack1_ema, [256]], # 35 128 40 40

  [[21, 19, 17], 1, ASFF_3, [64, 1]], # 36 32 40 40
  [[36, 20, 35], 1, Concat, [1]], # 37 256 40 40
  [-1, 1, GAhostELANStack1_ema, [512]], # 38 256 40 40

  [35, 1, GAConv, [256, 3, 2]], # 39 128 20 20
  [[-1, 11], 1, Concat, [1]], # 40 256 20 20
  [-1, 1, GAhostELANStack1_ema, [256]], # 41 128 20 20
  
  [[21, 19, 17], 1, ASFF_3, [128, 2]], # 42 64 80 80
  [[42, 17, 41], 1, Concat, [1]], # 43 256 20 20
  [-1, 1, GAhostELANStack1_ema, [1024]], # 44 512 20 20

  [[32, 38, 44], 1, Detect, [nc, anchors]],
  ]
