# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, MSGConv, [128, 3, 2]],  # 1-P2/4
   [-1, 2, C3MSGR, [128]],
   [-1, 1, MSGConv, [256, 3, 2]],  # 3-P3/8
   [-1, 4, C3MSGR, [256]],
   [-1, 1, MSGConv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, C3MSGR, [512]],
   [-1, 1, MSGConv, [1024, 3, 2]],  # 7-P5/32
   [-1, 2, C3MSGR, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, MSGConv, [512, 1, 1]],
   [-1, 1, CARAFE, []],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, MSGELAN, [512]],  # 13

   [-1, 1, MSGConv, [256, 1, 1]],
   [-1, 1, CARAFE, []],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, MSGELAN, [256]],  # 17 (P3/8-small)

   [-1, 1, MSGConv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, MSGELAN, [512]],  # 20 (P4/16-medium)

   [-1, 1, MSGConv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, MSGELAN, [1024]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
